import pytest
from src.utils import read_excel
import sys
from pathlib import Path
from src.config import ROOT_PATH


@pytest.fixture()
def path_to_file():
    return "/Users/ekaterinakurockina/PycharmProjects/pythonProject5/data/OperationsTest.xlsx"


def test_read_excel(path_to_file):
    assert read_excel(path_to_file) == [
        {
            "Бонусы (включая кешбэк)": 3,
            "Валюта операции": "RUB",
            "Валюта платежа": "RUB",
            "Дата операции": "31.12.2021 16:44:00",
            "Дата платежа": "31.12.2021",
            "Категория": "Супермаркеты",
            "Кешбэк": 0,
            "МСС": 5411,
            "Номер карты": "*7197",
            "Округление на Инвесткопилку": 0,
            "Описание": "Колхоз",
            "Статус": "OK",
            "Сумма операции": -160.89,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Бонусы (включая кешбэк)": 1,
            "Валюта операции": "RUB",
            "Валюта платежа": "RUB",
            "Дата операции": "31.12.2021 16:42:04",
            "Дата платежа": "31.12.2021",
            "Категория": "Супермаркеты",
            "Кешбэк": 0,
            "МСС": 5411,
            "Номер карты": "*7197",
            "Округление на Инвесткопилку": 0,
            "Описание": "Колхоз",
            "Статус": "OK",
            "Сумма операции": -64,
            "Сумма операции с округлением": 64,
        },
    ]
